# LinePatternSegment Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinePatternSegment Members
LinePatternSegment Class Constructors Methods Properties See Also
---
The LinePatternSegment type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LinePatternSegment()()()() | Creates a line pattern segment. |
| LinePatternSegment(LinePatternSegmentType, Double) | Creates a line pattern segment with given type and length. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the LinePatternSegment |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Length | Gets and sets the length of the segment. |
| Type | Gets and sets the type of the segment. |

# See Also
LinePatternSegment Class
Autodesk.Revit.DB Namespace